In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [3]:
#creating series by passing a list. panda creates the default integer index
pd.Series([1,np.nan,3,7,9, 42])

0     1.0
1     NaN
2     3.0
3     7.0
4     9.0
5    42.0
dtype: float64

In [4]:
#creating DataFrame by NumPy with dates as index and labeled columns
dates = pd.date_range('20181001', periods=8)
print(dates)
print(type(dates))

DatetimeIndex(['2018-10-01', '2018-10-02', '2018-10-03', '2018-10-04',
               '2018-10-05', '2018-10-06', '2018-10-07', '2018-10-08'],
              dtype='datetime64[ns]', freq='D')
<class 'pandas.core.indexes.datetimes.DatetimeIndex'>

In [5]:
df=pd.DataFrame(np.random.randn(8,5), index=dates, columns=list('ABCDE'))
df

                   A         B         C         D         E
2018-10-01 -0.022323  0.025413  1.047941  0.393597  0.234800
2018-10-02  1.196278  0.283341  0.462518  0.162173  1.726335
2018-10-03 -1.050749 -0.387002 -0.600210  1.028438  0.002499
2018-10-04 -0.416127 -0.120052 -0.215006 -0.396637 -0.816270
2018-10-05 -0.923648  0.974412 -0.054414 -1.005201  0.121233
2018-10-06 -0.371441  1.467956  1.409468  1.932297 -0.220612
2018-10-07  0.299861 -1.128777  0.445789  0.863835 -0.356847
2018-10-08 -0.964476  1.540136  1.569688  0.485036  0.929226

In [6]:
#viewing data
df.head()

                   A         B         C         D         E
2018-10-01 -0.022323  0.025413  1.047941  0.393597  0.234800
2018-10-02  1.196278  0.283341  0.462518  0.162173  1.726335
2018-10-03 -1.050749 -0.387002 -0.600210  1.028438  0.002499
2018-10-04 -0.416127 -0.120052 -0.215006 -0.396637 -0.816270
2018-10-05 -0.923648  0.974412 -0.054414 -1.005201  0.121233

In [7]:
df.tail(2)

                   A         B         C         D         E
2018-10-07  0.299861 -1.128777  0.445789  0.863835 -0.356847
2018-10-08 -0.964476  1.540136  1.569688  0.485036  0.929226

In [8]:
df.values

array([[-0.02232347,  0.02541282,  1.04794149,  0.39359654,  0.23479978],
       [ 1.19627777,  0.28334138,  0.46251804,  0.16217326,  1.72633492],
       [-1.05074876, -0.3870017 , -0.60020992,  1.02843811,  0.00249906],
       [-0.41612724, -0.12005214, -0.21500584, -0.39663699, -0.81627009],
       [-0.92364761,  0.97441162, -0.05441391, -1.00520134,  0.1212335 ],
       [-0.3714408 ,  1.4679564 ,  1.40946821,  1.93229698, -0.22061242],
       [ 0.29986089, -1.12877656,  0.44578924,  0.86383531, -0.35684711],
       [-0.96447558,  1.54013644,  1.56968785,  0.48503612,  0.92922618]])

In [9]:
#shows a quick statistic summary of your data:
df.describe()

              A         B         C         D         E
count  8.000000  8.000000  8.000000  8.000000  8.000000
mean  -0.281578  0.331929  0.508222  0.432942  0.202545
std    0.763988  0.934592  0.784172  0.896213  0.795311
min   -1.050749 -1.128777 -0.600210 -1.005201 -0.816270
25%   -0.933855 -0.186790 -0.094562  0.022471 -0.254671
50%   -0.393784  0.154377  0.454154  0.439316  0.061866
75%    0.058223  1.097798  1.138323  0.904986  0.408406
max    1.196278  1.540136  1.569688  1.932297  1.726335

In [10]:
df.index

DatetimeIndex(['2018-10-01', '2018-10-02', '2018-10-03', '2018-10-04',
               '2018-10-05', '2018-10-06', '2018-10-07', '2018-10-08'],
              dtype='datetime64[ns]', freq='D')

In [11]:
df.columns

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [12]:
#transposing your data
print("data")
print(df)
print("transpose")
print(df.T)

data
                   A         B         C         D         E
2018-10-01 -0.022323  0.025413  1.047941  0.393597  0.234800
2018-10-02  1.196278  0.283341  0.462518  0.162173  1.726335
2018-10-03 -1.050749 -0.387002 -0.600210  1.028438  0.002499
2018-10-04 -0.416127 -0.120052 -0.215006 -0.396637 -0.816270
2018-10-05 -0.923648  0.974412 -0.054414 -1.005201  0.121233
2018-10-06 -0.371441  1.467956  1.409468  1.932297 -0.220612
2018-10-07  0.299861 -1.128777  0.445789  0.863835 -0.356847
2018-10-08 -0.964476  1.540136  1.569688  0.485036  0.929226
transpose
   2018-10-01  2018-10-02  2018-10-03  2018-10-04  2018-10-05  2018-10-06  \
A   -0.022323    1.196278   -1.050749   -0.416127   -0.923648   -0.371441
B    0.025413    0.283341   -0.387002   -0.120052    0.974412    1.467956
C    1.047941    0.462518   -0.600210   -0.215006   -0.054414    1.409468
D    0.393597    0.162173    1.028438   -0.396637   -1.005201    1.932297
E    0.234800    1.726335    0.002499   -0.816270    0.121233   -0.220612

   2018-10-07  2018-10-08
A    0.299861   -0.964476
B   -1.128777    1.540136
C    0.445789    1.569688
D    0.863835    0.485036
E   -0.356847    0.929226

In [13]:
#Sorting by an axis
df.sort_index(axis=1, ascending=False)

                   E         D         C         B         A
2018-10-01  0.234800  0.393597  1.047941  0.025413 -0.022323
2018-10-02  1.726335  0.162173  0.462518  0.283341  1.196278
2018-10-03  0.002499  1.028438 -0.600210 -0.387002 -1.050749
2018-10-04 -0.816270 -0.396637 -0.215006 -0.120052 -0.416127
2018-10-05  0.121233 -1.005201 -0.054414  0.974412 -0.923648
2018-10-06 -0.220612  1.932297  1.409468  1.467956 -0.371441
2018-10-07 -0.356847  0.863835  0.445789 -1.128777  0.299861
2018-10-08  0.929226  0.485036  1.569688  1.540136 -0.964476

In [14]:
#sort by values
df.sort_values(by='D')

                   A         B         C         D         E
2018-10-05 -0.923648  0.974412 -0.054414 -1.005201  0.121233
2018-10-04 -0.416127 -0.120052 -0.215006 -0.396637 -0.816270
2018-10-02  1.196278  0.283341  0.462518  0.162173  1.726335
2018-10-01 -0.022323  0.025413  1.047941  0.393597  0.234800
2018-10-08 -0.964476  1.540136  1.569688  0.485036  0.929226
2018-10-07  0.299861 -1.128777  0.445789  0.863835 -0.356847
2018-10-03 -1.050749 -0.387002 -0.600210  1.028438  0.002499
2018-10-06 -0.371441  1.467956  1.409468  1.932297 -0.220612

In [15]:
#Creating a DataFrame by passing a dict of objects. dictionary objects get converted to series-like.
df1= pd.DataFrame({ 'A':'hi',
                    'B':1,
                    'C': 'foo',
                    'D': np.array([2]*4),
                    'E': pd.Series(np.random.randint(1,4,4),index=list(range(4)),dtype='float32')
                  })
df1

    A  B    C  D    E
0  hi  1  foo  2  1.0
1  hi  1  foo  2  2.0
2  hi  1  foo  2  3.0
3  hi  1  foo  2  2.0

In [16]:
#data types of columns
df1.dtypes

A     object
B      int64
C     object
D      int64
E    float32
dtype: object

In [17]:
a_ascii = ord('A')
a_ascii

65

In [18]:
alpha = [chr(i) for i in range(a_ascii, a_ascii+26)]
alpha

['A',
 'B',
 'C',
 'D',
 'E',
 'F',
 'G',
 'H',
 'I',
 'J',
 'K',
 'L',
 'M',
 'N',
 'O',
 'P',
 'Q',
 'R',
 'S',
 'T',
 'U',
 'V',
 'W',
 'X',
 'Y',
 'Z']

In [19]:
numbers= np.arange(26)
numbers

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16,
       17, 18, 19, 20, 21, 22, 23, 24, 25])

In [20]:
type(numbers)
#type(alpha)

numpy.ndarray

In [21]:
alpha_num= dict(zip(numbers,alpha))
#type(alpha_num)
alpha_num

{0: 'A',
 1: 'B',
 2: 'C',
 3: 'D',
 4: 'E',
 5: 'F',
 6: 'G',
 7: 'H',
 8: 'I',
 9: 'J',
 10: 'K',
 11: 'L',
 12: 'M',
 13: 'N',
 14: 'O',
 15: 'P',
 16: 'Q',
 17: 'R',
 18: 'S',
 19: 'T',
 20: 'U',
 21: 'V',
 22: 'W',
 23: 'X',
 24: 'Y',
 25: 'Z'}

In [22]:
pd.Series(alpha_num)

0     A
1     B
2     C
3     D
4     E
5     F
6     G
7     H
8     I
9     J
10    K
11    L
12    M
13    N
14    O
15    P
16    Q
17    R
18    S
19    T
20    U
21    V
22    W
23    X
24    Y
25    Z
dtype: object

In [23]:
#making series using a dictionary
d = {'a' : 0., 'b' : 1., 'c' : 2.}
pd.Series(d)

a    0.0
b    1.0
c    2.0
dtype: float64

In [24]:
ser=pd.Series(d, index=['m', 'n', 'b', 'c'])
ser

m    NaN
n    NaN
b    1.0
c    2.0
dtype: float64

In [114]:
df =df.sort_values(by=df.columns.tolist())
df

                   A         B         C         D         E
2018-10-04 -1.940553 -0.465528 -1.056533  0.270076  0.348822
2018-10-08 -1.642539 -0.015005 -0.196583 -0.433937  1.623610
2018-10-03 -0.788798  1.684057 -0.030216 -1.505458  0.283767
2018-10-02 -0.338805  0.543087 -1.956426 -1.705472  0.295164
2018-10-07 -0.071780  1.103094  0.655575 -0.586446 -1.538508
2018-10-06  0.405757 -1.175372  1.125563 -0.072352 -1.201452
2018-10-05  1.149059  0.959669  0.372954 -2.310132  0.583047
2018-10-01  1.222231  0.331885  0.515486 -0.879656  1.114148

In [120]:
#selecting via [], slicing
df[:3]

                   A         B         C         D         E
2018-10-04 -1.940553 -0.465528 -1.056533  0.270076  0.348822
2018-10-08 -1.642539 -0.015005 -0.196583 -0.433937  1.623610
2018-10-03 -0.788798  1.684057 -0.030216 -1.505458  0.283767

In [121]:
#Select a single column
df['B']

2018-10-04   -0.465528
2018-10-08   -0.015005
2018-10-03    1.684057
2018-10-02    0.543087
2018-10-07    1.103094
2018-10-06   -1.175372
2018-10-05    0.959669
2018-10-01    0.331885
Name: B, dtype: float64

In [125]:
#select using label
df.loc[dates[1]]

A   -0.338805
B    0.543087
C   -1.956426
D   -1.705472
E    0.295164
Name: 2018-10-02 00:00:00, dtype: float64

In [135]:
df.loc[:,['A','C']].sort_index(axis=0)

                   A         C
2018-10-01  1.222231  0.515486
2018-10-02 -0.338805 -1.956426
2018-10-03 -0.788798 -0.030216
2018-10-04 -1.940553 -1.056533
2018-10-05  1.149059  0.372954
2018-10-06  0.405757  1.125563
2018-10-07 -0.071780  0.655575
2018-10-08 -1.642539 -0.196583

In [136]:
df.at[dates[0],'A']

1.2222307012479785

In [31]:
df=df.reindex(dates)
df

                   A         B         C         D         E
2018-10-01 -0.022323  0.025413  1.047941  0.393597  0.234800
2018-10-02  1.196278  0.283341  0.462518  0.162173  1.726335
2018-10-03 -1.050749 -0.387002 -0.600210  1.028438  0.002499
2018-10-04 -0.416127 -0.120052 -0.215006 -0.396637 -0.816270
2018-10-05 -0.923648  0.974412 -0.054414 -1.005201  0.121233
2018-10-06 -0.371441  1.467956  1.409468  1.932297 -0.220612
2018-10-07  0.299861 -1.128777  0.445789  0.863835 -0.356847
2018-10-08 -0.964476  1.540136  1.569688  0.485036  0.929226

In [32]:
#select via position of passed integers
df.iloc[4]

A   -0.923648
B    0.974412
C   -0.054414
D   -1.005201
E    0.121233
Name: 2018-10-05 00:00:00, dtype: float64

In [33]:
#integer slices
df.iloc[2:5,0:4]

                   A         B         C         D
2018-10-03 -1.050749 -0.387002 -0.600210  1.028438
2018-10-04 -0.416127 -0.120052 -0.215006 -0.396637
2018-10-05 -0.923648  0.974412 -0.054414 -1.005201

In [34]:
df[df.A>0]

                   A         B         C         D         E
2018-10-02  1.196278  0.283341  0.462518  0.162173  1.726335
2018-10-07  0.299861 -1.128777  0.445789  0.863835 -0.356847

In [35]:
df[df>0]

                   A         B         C         D         E
2018-10-01       NaN  0.025413  1.047941  0.393597  0.234800
2018-10-02  1.196278  0.283341  0.462518  0.162173  1.726335
2018-10-03       NaN       NaN       NaN  1.028438  0.002499
2018-10-04       NaN       NaN       NaN       NaN       NaN
2018-10-05       NaN  0.974412       NaN       NaN  0.121233
2018-10-06       NaN  1.467956  1.409468  1.932297       NaN
2018-10-07  0.299861       NaN  0.445789  0.863835       NaN
2018-10-08       NaN  1.540136  1.569688  0.485036  0.929226

In [36]:
#Filter using isin()
df2=df.reindex(dates).copy()
df2['E']=['one', 'two', 'three', 'four', 'five', 'six', 'seven','eight']
df2[df2['E'].isin(['two','one'])]

                   A         B         C         D    E
2018-10-01 -0.022323  0.025413  1.047941  0.393597  one
2018-10-02  1.196278  0.283341  0.462518  0.162173  two

In [37]:
df1.at[0,1]=0
df1

    A  B    C  D    E    1
0  hi  1  foo  2  1.0  0.0
1  hi  1  foo  2  2.0  NaN
2  hi  1  foo  2  3.0  NaN
3  hi  1  foo  2  2.0  NaN

In [212]:
df1.dropna(how='any')

    A  B    C  D    E    1
0  hi  1  foo  2  2.0  0.0

In [42]:
df1.fillna(value=5)

    A  B    C  D    E    1
0  hi  1  foo  2  1.0  0.0
1  hi  1  foo  2  2.0  5.0
2  hi  1  foo  2  3.0  5.0
3  hi  1  foo  2  2.0  5.0

In [41]:
 pd.isna(df1)

       A      B      C      D      E      1
0  False  False  False  False  False  False
1  False  False  False  False  False   True
2  False  False  False  False  False   True
3  False  False  False  False  False   True

In [40]:
df2.mean(axis=0)

A   -0.281578
B    0.331929
C    0.508222
D    0.432942
dtype: float64

In [39]:
df.at[dates[0],:]=9.0
df

                   A         B         C         D         E
2018-10-01  9.000000  9.000000  9.000000  9.000000  9.000000
2018-10-02  1.196278  0.283341  0.462518  0.162173  1.726335
2018-10-03 -1.050749 -0.387002 -0.600210  1.028438  0.002499
2018-10-04 -0.416127 -0.120052 -0.215006 -0.396637 -0.816270
2018-10-05 -0.923648  0.974412 -0.054414 -1.005201  0.121233
2018-10-06 -0.371441  1.467956  1.409468  1.932297 -0.220612
2018-10-07  0.299861 -1.128777  0.445789  0.863835 -0.356847
2018-10-08 -0.964476  1.540136  1.569688  0.485036  0.929226

In [45]:
new_series = pd.Series([41,23,34,6,np.nan,9,1,78], index=dates).shift(2)
new_series

2018-10-01     NaN
2018-10-02     NaN
2018-10-03    41.0
2018-10-04    23.0
2018-10-05    34.0
2018-10-06     6.0
2018-10-07     NaN
2018-10-08     9.0
Freq: D, dtype: float64

In [47]:
print('df')
print(df)
df.sub(new_series,axis='index')

df
                   A         B         C         D         E
2018-10-01  9.000000  9.000000  9.000000  9.000000  9.000000
2018-10-02  1.196278  0.283341  0.462518  0.162173  1.726335
2018-10-03 -1.050749 -0.387002 -0.600210  1.028438  0.002499
2018-10-04 -0.416127 -0.120052 -0.215006 -0.396637 -0.816270
2018-10-05 -0.923648  0.974412 -0.054414 -1.005201  0.121233
2018-10-06 -0.371441  1.467956  1.409468  1.932297 -0.220612
2018-10-07  0.299861 -1.128777  0.445789  0.863835 -0.356847
2018-10-08 -0.964476  1.540136  1.569688  0.485036  0.929226

                    A          B          C          D          E
2018-10-01        NaN        NaN        NaN        NaN        NaN
2018-10-02        NaN        NaN        NaN        NaN        NaN
2018-10-03 -42.050749 -41.387002 -41.600210 -39.971562 -40.997501
2018-10-04 -23.416127 -23.120052 -23.215006 -23.396637 -23.816270
2018-10-05 -34.923648 -33.025588 -34.054414 -35.005201 -33.878767
2018-10-06  -6.371441  -4.532044  -4.590532  -4.067703  -6.220612
2018-10-07        NaN        NaN        NaN        NaN        NaN
2018-10-08  -9.964476  -7.459864  -7.430312  -8.514964  -8.070774

In [48]:
#Applying functions to data
df.apply(np.cumsum)

                    A          B          C          D          E
2018-10-01   9.000000   9.000000   9.000000   9.000000   9.000000
2018-10-02  10.196278   9.283341   9.462518   9.162173  10.726335
2018-10-03   9.145529   8.896340   8.862308  10.190611  10.728834
2018-10-04   8.729402   8.776288   8.647302   9.793974   9.912564
2018-10-05   7.805754   9.750699   8.592888   8.788773  10.033797
2018-10-06   7.434313  11.218656  10.002357  10.721070   9.813185
2018-10-07   7.734174  10.089879  10.448146  11.584905   9.456338
2018-10-08   6.769699  11.630015  12.017834  12.069941  10.385564

In [49]:
df.apply(lambda x: x.max() - x.min())

A    10.050749
B    10.128777
C     9.600210
D    10.005201
E     9.816270
dtype: float64

In [53]:
s = pd.Series(np.random.randint(0, 7, size=10))
print(s)
print(s.value_counts())

0    4
1    3
2    3
3    4
4    5
5    3
6    3
7    2
8    1
9    5
dtype: int64
3    4
5    2
4    2
2    1
1    1
dtype: int64

In [58]:
#string method, str attribute
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Bca', np.nan, 'ABAC', 'cat','coW'])
print('s')
print(s,'\n')
print(s.str.lower())

s
0       A
1       B
2       C
3    Aaba
4     Bca
5     NaN
6    ABAC
7     cat
8     coW
dtype: object

0       a
1       b
2       c
3    aaba
4     bca
5     NaN
6    abac
7     cat
8     cow
dtype: object

In [71]:
#Merge
df = pd.DataFrame(np.random.randint(0,10, size=(10,4)))
df

   0  1  2  3
0  5  8  3  6
1  1  0  5  0
2  8  0  7  7
3  3  9  5  5
4  1  3  6  4
5  5  9  5  5
6  5  4  4  0
7  9  6  0  3
8  3  0  7  1
9  3  0  9  8

In [75]:
#break into pieces
pieces = [df[:3], df[3:7], df[7:]]
pieces

[   0  1  2  3
 0  5  8  3  6
 1  1  0  5  0
 2  8  0  7  7,    0  1  2  3
 3  3  9  5  5
 4  1  3  6  4
 5  5  9  5  5
 6  5  4  4  0,    0  1  2  3
 7  9  6  0  3
 8  3  0  7  1
 9  3  0  9  8]

In [76]:
pd.concat(pieces)

   0  1  2  3
0  5  8  3  6
1  1  0  5  0
2  8  0  7  7
3  3  9  5  5
4  1  3  6  4
5  5  9  5  5
6  5  4  4  0
7  9  6  0  3
8  3  0  7  1
9  3  0  9  8

In [80]:
#SQL style merge
left = pd.DataFrame({'key': ['Hi', 'Hi'], 'lval': [1, 2]})
right = pd.DataFrame({'key': ['Hi', 'Hi'], 'rval': [4, 5]})
print(left)
print(right)
pd.merge(left, right, on='key')

  key  lval
0  Hi     1
1  Hi     2
  key  rval
0  Hi     4
1  Hi     5

  key  lval  rval
0  Hi     1     4
1  Hi     1     5
2  Hi     2     4
3  Hi     2     5

In [81]:
left = pd.DataFrame({'key': ['Hi', 'yes'], 'lval': [1, 2]})
right = pd.DataFrame({'key': ['yes', 'Hi'], 'rval': [4, 5]})
print(left)
print(right)
pd.merge(left, right, on='key')

   key  lval
0   Hi     1
1  yes     2
   key  rval
0  yes     4
1   Hi     5

   key  lval  rval
0   Hi     1     5
1  yes     2     4

In [86]:
#Append
a=df.iloc[3]
df.append(a,ignore_index=True)
#without ignore_index, index 3 is appended as it is

    0  1  2  3
0   5  8  3  6
1   1  0  5  0
2   8  0  7  7
3   3  9  5  5
4   1  3  6  4
5   5  9  5  5
6   5  4  4  0
7   9  6  0  3
8   3  0  7  1
9   3  0  9  8
10  3  9  5  5

In [93]:
df.groupby(1).sum()

    0   2   3
1
0  15  28  16
3   1   6   4
4   5   4   0
6   9   0   3
8   5   3   6
9   8  10  10